USDT = "USDT"
BEMO = "بيمو🇸🇦🇫🇷"
BARAKAH = "بركة🇧🇭"
SYRCASH = "Syriatel Cash🇸🇾"
MTNCASH = "MTN Cash🇸🇾"
PAYEER = "PAYEER"
PERFECT_MONEY = "PERFECT MONEY"

POINT_DEPOSIT = "نقاط وكلاء"
CREATE_ACCOUNT_DEPOSIT = "إيداع إنشاء حساب"
GHAFLA_OFFER = "عرض الغفلة"
LUCKY_HOUR_OFFER = "ساعة الحظ"
CANCELED_ORDER = "طلب سحب ملغى رقم <code>{}</code>"
SPLIT_ORDER = "طلب سحب مرتجع رقم <code>{}</code>"

CRYPTO_LIST = [
    USDT,
    PAYEER,
    PERFECT_MONEY,
]

PAYMENT_METHODS_LIST = [
    USDT,
    BEMO,
    BARAKAH,
    SYRCASH,
    MTNCASH,
    PAYEER,
    PERFECT_MONEY,
]

TEAM_CASH_TEXT = (
    "انسخ القالب أدناه واملأ معلومات TeamCash كما هو موضح في المثال أدناه:\n\n"
    "<code>User ID: \n"
    "Password: \n"
    "Workplace ID: </code>\n\n"
    "المثال:\n\n"
    "<code>User ID: Someone\n"
    "Password: 12345abcd\n"
    "Workplace ID: 123456</code>\n\n"
)

AFFILIATE_TEXT = (
    "جيد، الآن معلومات Affiliate أيضاً بنسخ القالب أدناه:\n\n"
    "<code>Username: \n"
    "Password: </code>\n\n"
    "مثال:\n\n"
    "<code>Username: SomeUsername\n"
    "Password: 12345abcd</code>\n\n"
)


AGENT_COMMAND_TEXT = (
    "سيظهر زر يؤدي إلى حسابك الشخصي بين قائمة الوكلاء الموصى بهم في محافظتك بعد أن تقوم بتسجيل الدخول بالمعلومات المرسلة\n\n"
    "اضغط على الزر أدناه للتسجيل ⬇️⬇️⬇️\n\n"
    "<b>ملاحظة: يمكنك الوصول إلى الزر في حال فقدانه بالضغط على الأمر /agent</b>"
)

LOGIN_GUIDE_TEXT = (
    "يوضح الفيديو المرفق خطوات تسجيل الدخول ⬆️⬆️⬆️\n\n" "أرسل الرقم التسلسلي للطلب"
)

CHOOSE_ORDERS_TEXT = (
    "يمكنك اختيار الرقم التسلسلي للعملية التي تريد الشكوى عنها من الأسفل ⬇️\n\n"
    "يتم إظهار آخر 20 عملية فقط.\n"
    "<b>ملاحظة: الطلبات التي تمت معالجة شكوى عنها سابقاً ليست ضمن القائمة.</b>"
)

BACK_TO_HOME_PAGE_TEXT = "العودة إلى القائمة الرئيسية🔙"

HOME_PAGE_TEXT = "القائمة الرئيسية 🔝"

EXT_COMPLAINT_LINE = "<b>ملحق بالشكوى على الطلب ذي الرقم التسلسلي {}</b>\n\n"


DECLINE_TEXT = "تم رفض الطلب ❌"
APPROVED_TEXT = "تمت الموافقة ✅"
